# Напишите программу, которая принимает на вход координаты 
# двух точек и находит расстояние между ними в 2D пространстве.

# Пример:

# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21

import math
a = [float(input(f'Введите координаты точки a по оси {i}: ')) for i in "xy"]
b = [float(input(f'Введите координаты точки b по оси {i}: ')) for i in "xy"]
distans = round (math.sqrt((a[0]-b[0])**2+(a[1]-b[1])**2), 3)
dis= round (sum([(n[1]-n[0])**2 for n in zip (a,b)])**0.5, 3)
print(f'Растояние между точкой A до точки B = {distans}' )
print(f'Растояние между точкой A до точки B = {dis}' )